<?php

$fh = fopen(__DIR__ . '/cunli_code.csv', 'r');
/*
 * Array
  (
  [0] => 縣市代碼
  [1] => 縣市名稱
  [2] => 區里代碼
  [3] => 區鄉鎮名稱
  [4] => 村里代碼
  [5] => 村里名稱
  )
 */
fgetcsv($fh, 2048);
$codes = array();
while ($line = fgetcsv($fh, 2048)) {
    if (!isset($codes[$line[1] . $line[3] . $line[5]])) {
        $codes[$line[1] . $line[3] . $line[5]] = $line[4];
    }
}
fclose($fh);

$replaces = array(
    '彰化縣員林鎮' => '彰化縣員林市',
    ' ' => '',
    '臺北市' => '台北市',
    '臺中市' => '台中市',
    '臺南市' => '台南市',
    '高雄市三民一' => '高雄市三民區',
    '高雄市三民二' => '高雄市三民區',
    '高雄市鳳山一' => '高雄市鳳山區',
    '高雄市鳳山二' => '高雄市鳳山區',
);

$stack = array(
    '新北市中和區瓦󿾨里' => '6500300-017',
    '新北市中和區灰󿾨里' => '6500300-054',
    '新北市樹林區󿾵寮里' => '6500700-007',
    '新北市坪林區石𥕢里' => '6502000-004',
    '台北市信義區富台里' => '6300200-019',
    '台北市萬華區糖廍里' => '6300700-015',
    '台中市大安區龜売里' => '6602200-004',
    '台南市西港區檨林里' => '6701400-004',
    '台南市新化區𦰡拔里' => '6701800-018',
    '台南市龍崎區石𥕢里' => '6703000-008',
    '台南市安南區󻕯南里' => '6703500-003',
    '台南市安南區公󻕯里' => '6703500-024',
    '彰化縣彰化市下廍里' => '1000701-002',
    '彰化縣彰化市磚󿾨里' => '1000701-030',
    '彰化縣彰化市南瑶里' => '1000701-039',
    '彰化縣彰化市寶廍里' => '1000701-059',
    '彰化縣埔鹽鄉廍子村' => '1000714-003',
    '彰化縣埔鹽鄉瓦󿾨村' => '1000714-010',
    '彰化縣芳苑鄉頂廍村' => '1000723-013',
    '南投縣竹山鎮硘󿾨里' => '1000804-005',
    '南投縣名間鄉廍下村' => '1000806-012',
    '雲林縣麥寮鄉瓦󿾨村' => '1000913-003',
    '雲林縣臺西鄉台西村' => '1000916-001',
    '雲林縣元長鄉瓦󿾨村' => '1000917-018',
    '雲林縣四湖鄉󿿀子村' => '1000918-016',
    '雲林縣四湖鄉󿿀東村' => '1000918-021',
    '雲林縣口湖鄉台子村' => '1000919-014',
    '雲林縣水林鄉𣐤埔村' => '1000920-021',
    '嘉義縣中埔鄉塩舘村' => '1001013-002',
    '嘉義縣中埔鄉石硦村' => '1001013-014',
    '屏東縣東港鎮下廍里' => '1001303-017',
    '屏東縣里港鄉三廍村' => '1001309-012',
    '屏東縣新園鄉瓦󿾨村' => '1001317-001',
    '屏東縣霧臺鄉霧台村' => '1001327-001',
    '澎湖縣馬公市󼱹裡里' => '1001601-031',
    '嘉義市西區磚󿾨里' => '1002002-018',
    '高雄市左營區復興里' => '6400300-014',
    '高雄市鳳山區海風里' => '6401200-023',
    '高雄市鳳山區誠正里' => '6401200-052',
);

$fhPool = array();

foreach (glob(__DIR__ . '/村里戶數人口數單一年齡人口數/*/*/*.csv') AS $csvFile) {
    $csvFh = fopen($csvFile, 'r');
    $header = fgetcsv($csvFh, 4096);
    while ($line = fgetcsv($csvFh, 4096)) {
        if (strlen($line[0]) === 5) {
            /*
             * Array
              (
              [0] => 10304
              [1] => 連江縣南竿鄉
              [2] => 仁愛村
             */
            $year = substr($line[0], 0, 3) + 1911;
            $month = substr($line[0], 3);
            if (false !== strpos($line[1], '桃園縣')) {
                $line[1] = mb_substr($line[1], 0, 2, 'utf-8') . '市' . mb_substr($line[1], 3, -1, 'utf-8') . '區';
                $line[2] = mb_substr($line[2], 0, -1, 'utf-8') . '里';
            } else {
                $line[1] = strtr($line[1], $replaces);
            }

            if (isset($codes[$line[1] . $line[2]])) {
                $cunliCode = $codes[$line[1] . $line[2]];
            } elseif (isset($stack["{$line[1]}{$line[2]}"])) {
                $cunliCode = $stack["{$line[1]}{$line[2]}"];
            } else {
                echo "{$line[1]}{$line[2]}\n";
                exit();
            }
        } else {
            print_r($line);
            exit();
        }
        $ym = "{$year}-{$month}";
        if (!isset($fhPool[$ym])) {
            if (!file_exists(__DIR__ . "/cunli/{$year}")) {
                mkdir(__DIR__ . "/cunli/{$year}", 0777, true);
            }
            $fhPool[$ym] = fopen(__DIR__ . "/cunli/{$year}/{$month}.csv", 'w');
            fputcsv($fhPool[$ym], array(
                'ym' => '年月',
                'code' => '村里代碼',
                'area' => '區域',
                'cunli' => '村里',
                'family' => '戶數',
                'population' => '人口',
                'm' => '男性人口',
                'f' => '女性人口',
                '<15' => '未滿15歲',
                '15-65' => '15-65歲',
                '>65' => '超過65歲',
            ));
        }
        $dataLine = array(
            'ym' => $ym,
            'code' => $cunliCode,
            'area' => $line[1],
            'cunli' => $line[2],
            'family' => $line[3],
            'population' => $line[4],
            'm' => $line[5],
            'f' => $line[6],
            '<15' => 0,
            '15-65' => 0,
            '>65' => 0,
        );
        foreach ($line AS $k => $v) {
            if ($k < 7) {
                continue;
            } elseif ($k < 37) {
                // < 15
                $dataLine['<15'] += $v;
            } elseif ($k < 139) {
                // 15 ~ 65
                $dataLine['15-65'] += $v;
            } else {
                // > 65
                $dataLine['>65'] += $v;
            }
        }
        fputcsv($fhPool[$ym], $dataLine);
    }
}