<?php

$fh = fopen(__DIR__ . '/villages.csv', 'r');
/*
 * Array
  (
  [0] => ivid
  [1] => id
  [2] => name
  [3] => town
  [4] => county
  [5] => vid
  [6] => icid
  [7] => itid
  )
 */
fgetcsv($fh, 2048);
$codes = array();
while ($line = fgetcsv($fh, 2048)) {
    if (!isset($codes[$line[1] . $line[3] . $line[5]])) {
        $codes[$line[4] . $line[3] . $line[2]] = $line[1];
    }
    if ($line[4] === '桃園縣') {
        $replacedKey = '桃園市' . mb_substr($line[3], 0, -1) . '區' . mb_substr($line[2], 0, -1, 'utf-8') . '里';
        $codes[$replacedKey] = $line[1];
    }
    if ($line[3] === '員林鎮') {
        $replacedKey = $line[4] . '員林市' . $line[2];
        $codes[$replacedKey] = $line[1];
    }
}
fclose($fh);

$replaces = array(
    ' ' => '',
    '　' => '',
    '高雄市三民一' => '高雄市三民區',
    '高雄市三民二' => '高雄市三民區',
    '高雄市鳳山一' => '高雄市鳳山區',
    '高雄市鳳山二' => '高雄市鳳山區',
    '苗栗縣頭份市' => '苗栗縣頭份鎮',
);

$stack = array(
    '彰化縣彰化市下廍里' => '10007010-002',
    '彰化縣彰化市南瑶里' => '10007010-039',
    '彰化縣彰化市寶廍里' => '10007010-059',
    '彰化縣彰化市磚󿾨里' => '10007010-030',
    '彰化縣埔鹽鄉瓦󿾨村' => '10007140-010',
    '彰化縣埔心鄉南舘村' => '10007150-013',
    '彰化縣埔心鄉埤脚村' => '10007150-020',
    '彰化縣埔心鄉新舘村' => '10007150-014',
    '彰化縣埔心鄉舊舘村' => '10007150-012',
    '彰化縣二水鄉上豊村' => '10007180-002',
    '南投縣竹山鎮硘󿾨里' => '10008040-005',
    '雲林縣麥寮鄉瓦󿾨村' => '10009130-003',
    '雲林縣元長鄉瓦󿾨村' => '10009170-018',
    '雲林縣四湖鄉󿿀子村' => '10009180-016',
    '雲林縣四湖鄉󿿀東村' => '10009180-021',
    '嘉義縣中埔鄉塩舘村' => '10010130-002',
    '嘉義縣中埔鄉石硦村' => '10010130-014',
    '嘉義縣竹崎鄉文峯村' => '10010140-018',
    '屏東縣新園鄉瓦󿾨村' => '10013170-001',
    '澎湖縣馬公市󼱹裡里' => '10016010-031',
    '嘉義市西區磚󿾨里' => '10020020-018',
    '新北市中和區瓦󿾨里' => '65000030-017',
    '新北市樹林區󿾵寮里' => '65000070-007',
    '臺中市大安區龜売里' => '66000220-004',
    '臺南市西港區檨林里' => '67000140-004',
    '臺南市安南區公󻕯里' => '67000350-024',
    '臺南市安南區󻕯南里' => '67000350-003',
    '新北市中和區灰󿾨里' => '65000030-054',
    '雲林縣麥寮鄉中興村' => '10009130-013',
    '新竹市東區關新里' => '10018010-054',
    '新竹市北區中雅里' => '10018020-045',
    '高雄市杉林區大愛里' => '64000340-008',
    '新竹縣竹北市中崙里' => '10004010-031', // http://news.ltn.com.tw/news/life/breakingnews/1989506
    '新北市板橋區公?里' => '65000010-021',
    '新北市中和區瓦??里' => '65000030-017',
    '新北市中和區灰??里' => '65000030-054',
    '新北市永和區新?里' => '65000040-045',
    '新北市新店區五?里' => '65000060-041',
    '新北市樹林區??寮里' => '65000070-007',
    '新北市三峽區永?里' => '65000090-006',
    '新北市瑞芳區爪?里' => '65000120-007',
    '新北市瑞芳區?新里' => '65000120-027',
    '新北市瑞芳區?洞里' => '65000120-028',
    '新北市土城區?廷里' => '65000130-017',
    '新北市坪林區石??里' => '65000200-004',
    '新北市萬里區崁?里' => '65000280-008',
    '臺北市萬華區糖?里' => '63000070-015',
    '桃園市大園區?林里' => '10003060-011',
    '桃園市新屋區?榔里' => '10003110-020',
    '臺中市西區公?里' => '66000040-009',
    '臺中市西區?龍里' => '66000040-024',
    '臺中市北屯區?子里' => '66000080-013',
    '臺中市清水區?榔里' => '66000120-016',
    '臺中市外埔區?子里' => '66000210-011',
    '臺中市大安區龜??里' => '66000220-004',
    '臺中市大肚區蔗?里' => '66000240-016',
    '臺南市新營區舊?里' => '67000010-022',
    '臺南市後壁區後?里' => '67000050-016',
    '臺南市麻豆區?江里' => '67000070-004',
    '臺南市麻豆區寮?里' => '67000070-015',
    '臺南市官田區南?里' => '67000100-008',
    '臺南市佳里區頂?里' => '67000120-014',
    '臺南市西港區??林里' => '67000140-004',
    '臺南市七股區?埕里' => '67000150-007',
    '臺南市七股區?榔里' => '67000150-020',
    '臺南市新化區山?里' => '67000180-016',
    '臺南市新化區??拔里' => '67000180-018',
    '臺南市山上區玉?里' => '67000220-005',
    '臺南市龍崎區石??里' => '67000300-008',
    '臺南市永康區?行里' => '67000310-010',
    '臺南市永康區?洲里' => '67000310-029',
    '臺南市安南區??南里' => '67000350-003',
    '臺南市安南區?田里' => '67000350-019',
    '臺南市安南區公??里' => '67000350-024',
    '高雄市左營區?北里' => '64000030-027',
    '高雄市左營區?南里' => '64000030-028',
    '高雄市鳥松區?埔里' => '64000180-004',
    '高雄市阿蓮區?山里' => '64000230-003',
    '高雄市湖內區公?里' => '64000250-004',
    '新竹縣竹東鎮上?里' => '10004020-006',
    '新竹縣竹東鎮?林里' => '10004020-012',
    '新竹縣北埔鄉水?村' => '10004090-004',
    '苗栗縣苑裡鎮山?里' => '10005020-014',
    '苗栗縣苑裡鎮上?里' => '10005020-021',
    '苗栗縣竹南鎮公?里' => '10005040-018',
    '苗栗縣三義鄉?湖村' => '10005130-002',
    '苗栗縣三義鄉?潭村' => '10005130-003',
    '彰化縣彰化市下?里' => '10007010-002',
    '彰化縣彰化市磚??里' => '10007010-030',
    '彰化縣彰化市南?里' => '10007010-039',
    '彰化縣彰化市寶?里' => '10007010-059',
    '彰化縣員林市大?里' => '10007100-030',
    '彰化縣埔鹽鄉?子村' => '10007140-003',
    '彰化縣埔鹽鄉瓦??村' => '10007140-010',
    '彰化縣埔心鄉舊?村' => '10007150-012',
    '彰化縣埔心鄉南?村' => '10007150-013',
    '彰化縣埔心鄉新?村' => '10007150-014',
    '彰化縣埔心鄉埤?村' => '10007150-020',
    '彰化縣芳苑鄉頂?村' => '10007230-013',
    '南投縣竹山鎮???里' => '10008040-005',
    '南投縣名間鄉?下村' => '10008060-012',
    '雲林縣斗六市崙?里' => '10009010-018',
    '雲林縣西螺鎮公?里' => '10009040-027',
    '雲林縣北港鎮公?里' => '10009060-011',
    '雲林縣麥寮鄉瓦??村' => '10009130-003',
    '雲林縣元長鄉瓦??村' => '10009170-018',
    '雲林縣四湖鄉??子村' => '10009180-016',
    '雲林縣四湖鄉??東村' => '10009180-021',
    '雲林縣水林鄉??埔村' => '10009200-021',
    '嘉義縣朴子市?溪里' => '10010020-012',
    '嘉義縣民雄鄉?福村' => '10010050-023',
    '嘉義縣中埔鄉??村' => '10010130-002',
    '嘉義縣中埔鄉石?村' => '10010130-014',
    '嘉義縣竹崎鄉文?村' => '10010140-018',
    '嘉義縣梅山鄉?溪村' => '10010150-010',
    '嘉義縣梅山鄉瑞?村' => '10010150-015',
    '屏東縣東港鎮下?里' => '10013030-017',
    '屏東縣萬丹鄉?北村' => '10013050-012',
    '屏東縣萬丹鄉?南村' => '10013050-013',
    '屏東縣里港鄉三?村' => '10013090-012',
    '屏東縣新園鄉瓦??村' => '10013170-001',
    '屏東縣林邊鄉崎?村' => '10013190-007',
    '屏東縣滿州鄉?林村' => '10013240-005',
    '屏東縣瑪家鄉?山村' => '10013280-003',
    '臺東縣關山鎮里?里' => '10014030-005',
    '臺東縣綠島鄉公?村' => '10014110-001',
    '臺東縣達仁鄉台?村' => '10014150-001',
    '臺東縣達仁鄉土?村' => '10014150-002',
    '澎湖縣馬公市??裡里' => '10016010-031',
    '澎湖縣湖西鄉?葉村' => '10016020-022',
    '嘉義市西區磚??里' => '10020020-018',
    '連江縣北竿鄉?里村' => '09007020-005',
    '雲林縣臺西鄉台西村' => '10009160-001',
    '雲林縣口湖鄉台子村' => '10009190-014',
    '高雄市左營區復興里' => '64000300-014',
    '高雄市鳳山區海風里' => '64000120-023',
    '高雄市鳳山區誠正里' => '64000120-052',
);

$fhPool = array();
$missingPool = array();
foreach (glob(__DIR__ . '/村里戶數人口數單一年齡人口數/*/*/*.csv') AS $csvFile) {
    $csvFh = fopen($csvFile, 'r');
    $header = fgets($csvFh, 4096);
    if(false === strpos($header, '統計年月')) {
      $header = fgets($csvFh, 4096);
    }
    $hasSiteId = false;
    if(false !== strpos($header, '區域別代碼')) {
      $hasSiteId = true;
    }
    while ($line = fgetcsv($csvFh, 4096)) {
      if (strlen($line[0]) !== 5) {
        print_r($line);
        exit();
      }
      /*
       * Array
        (
        [0] => 10304
        [1] => 連江縣南竿鄉
        [2] => 仁愛村
       */
      $year = substr($line[0], 0, 3) + 1911;
      $month = substr($line[0], 3);
      $targetFile = __DIR__ . "/cunli/{$year}/{$month}.csv";
      if(file_exists($targetFile)) {
        //continue;
      }
      if($hasSiteId) {
        //[1] => 65000010001 => 65000010-001
        $areaPart = substr($line[1], 0, 8);
        switch($areaPart) {
          case '64000121':
          case '64000122':
            $areaPart = '64000120';
          break;
          case '64000051':
          case '64000052':
            $areaPart = '64000050';
          break;
        }
        $cunliCode = $areaPart . '-' . substr($line[1], 8, 3);
        // if(!in_array($cunliCode, $codes)) {
        //   print_r(array(
        //     'code' => $cunliCode,
        //     'area' => $line[2],
        //     'cunli' => $line[3],
        //   ));
        // }
      } else {
        if (false !== strpos($line[1], '桃園縣')) {
            $line[1] = mb_substr($line[1], 0, 2, 'utf-8') . '市' . mb_substr($line[1], 3, -1, 'utf-8') . '區';
            $line[2] = mb_substr($line[2], 0, -1, 'utf-8') . '里';
        } else {
            $line[1] = strtr($line[1], $replaces);
        }

        if (isset($codes[$line[1] . $line[2]])) {
            $cunliCode = $codes[$line[1] . $line[2]];
        } elseif (isset($stack["{$line[1]}{$line[2]}"])) {
            $cunliCode = $stack["{$line[1]}{$line[2]}"];
        } else {
            if (!isset($missingPool["{$line[1]}{$line[2]}"])) {
                $missingPool["{$line[1]}{$line[2]}"] = true;
                echo "'{$line[1]}{$line[2]}' => '',\n";
            }
        }
      }
      $line[2] = strtr($line[2], $replaces);
      $ym = "{$year}-{$month}";
      if (!isset($fhPool[$ym])) {
        if (!file_exists(__DIR__ . "/cunli/{$year}")) {
            mkdir(__DIR__ . "/cunli/{$year}", 0777, true);
        }
        $fhPool[$ym] = fopen($targetFile, 'w');
        fputcsv($fhPool[$ym], array(
            'ym' => '年月',
            'code' => '村里代碼',
            'area' => '區域',
            'cunli' => '村里',
            'family' => '戶數',
            'population' => '人口',
            'm' => '男性人口',
            'f' => '女性人口',
            '<15' => '未滿15歲',
            '15-64' => '15-64歲',
            '>64' => '超過64歲',
            '>20' => '超過20歲',
            '18-19' => '18-19歲',
        ));
      }
      if($hasSiteId) {
        $dataLine = array(
          'ym' => $ym,
          'code' => $cunliCode,
          'area' => $line[2],
          'cunli' => $line[3],
          'family' => $line[4],
          'population' => $line[5],
          'm' => $line[6],
          'f' => $line[7],
          '<15' => 0,
          '15-64' => 0,
          '>64' => 0,
          '>20' => 0,
          '18-19' => 0,
        );
        foreach ($line AS $k => $v) {
          if ($k < 8) {
            continue;
          } elseif ($k < 38) {
            // < 15
            $dataLine['<15'] += $v;
          } elseif ($k < 138) {
            // 15 ~ 64
            $dataLine['15-64'] += $v;
          } else {
            // > 64
            $dataLine['>64'] += $v;
          }
          if (in_array($k, array(44, 45, 46, 47))) {
            $dataLine['18-19'] += $v;
          }
          if ($k > 47) {
            $dataLine['>20'] += $v;
          }
        }
      } else {
        $dataLine = array(
          'ym' => $ym,
          'code' => $cunliCode,
          'area' => $line[1],
          'cunli' => $line[2],
          'family' => $line[3],
          'population' => $line[4],
          'm' => $line[5],
          'f' => $line[6],
          '<15' => 0,
          '15-64' => 0,
          '>64' => 0,
          '>20' => 0,
          '18-19' => 0,
        );
        foreach ($line AS $k => $v) {
          if ($k < 7) {
            continue;
          } elseif ($k < 37) {
            // < 15
            $dataLine['<15'] += $v;
          } elseif ($k < 137) {
            // 15 ~ 64
            $dataLine['15-64'] += $v;
          } else {
            // > 64
            $dataLine['>64'] += $v;
          }
          if (in_array($k, array(43, 44, 45, 46))) {
            $dataLine['18-19'] += $v;
          }
          if ($k > 46) {
            $dataLine['>20'] += $v;
          }
        }
      }
      fputcsv($fhPool[$ym], $dataLine);
    }
}
